app/controllers/admin_controller.rb

	def index
		@testimonials = Testimonial.all
		@downloads = Download.all
---
SELECT `testimonials`.* FROM `testimonials`
SELECT `downloads`.* FROM `downloads`