app/controllers/downloads_controller.rb

INSERT INTO `downloads` (`business_name`, `comment`, `created_at`, `downloaded`, `email`, `name`, `phone`, `updated_at`) VALUES ('styletag', 'tagagag', '2013-08-11 13:28:50', NULL, 'test@test.com', 'Hemanth Raju', '919538795381', '2013-08-11 13:28:50')
---
	def create
		Download.create(params[:download])