app/controllers/testimonials_controller.rb

INSERT INTO `testimonials` (`business_name`, `created_at`, `email`, `name`, `phone`, `publish_testimonial`, `testimonial_text`, `updated_at`) VALUES ('test name', '2013-08-11 09:41:37', 'test', 'test', '9538795381', NULL, 'test test test', '2013-08-11 09:41:37')
---
	def create
		Testimonial.create(params[:testimonial])

SELECT `testimonials`.* FROM `testimonials` WHERE `testimonials`.`id` = 1 LIMIT 1
---
	def show
	 @testimonial = Testimonial.find(params[:id])

SELECT `testimonials`.* FROM `testimonials` WHERE `testimonials`.`id` = 1 LIMIT 1
UPDATE `testimonials` SET `publish_testimonial` = 1, `updated_at` = '2013-08-11 12:35:04' WHERE `testimonials`.`id` = 1
---
	def update
		@testimonial = Testimonial.find(params[:id])
		@testimonial.update_attributes(params[:testimonial])

SELECT `testimonials`.* FROM `testimonials` WHERE `testimonials`.`id` = 0 LIMIT 1
DELETE FROM `testimonials` WHERE `testimonials`.`id` = 2
---
	def destroy
    @testimonial = Testimonial.find(params[:id])
    @testimonial.destroy