app/controllers/welcome_controller.rb

  def index
  	@testimonial = Testimonial.new
  	@alltestimonial = Testimonial.all
---
SELECT `testimonials`.* FROM `testimonials`